In [136]:
import pandas as pd
import glob

# Get a list of all CSV file paths in the data folder
csv_files = glob.glob('data/*.csv')

# Load each CSV file as a dataframe
dataframes = {}
for file in csv_files:
    # Extract the filename without extension as the dataframe name
    dataframe_name = file.split('/')[-1].split('\\')[-1].split('.')[0]
    # Load the CSV file as a dataframe
    dataframes[dataframe_name] = pd.read_csv(file)

# Access the dataframes using their names
enlistment_facts_df = dataframes['enlistment_facts']
classes_df = dataframes['classes']
departments_df = dataframes['departments']
schools_df = dataframes['schools']
students_df = dataframes['students']
payments_df = dataframes['payments']

In [137]:
enlistment_facts_df.head()

   student_id  class_id  payment_id
0           1        43           1
1           1        17           2
2           1        44           3
3           1        39           4
4           1        31           5

In [138]:
classes_df.head()

,class_id,department_id,section_label,units,rate_per_unit,revenue_per_student,class_year,class_semester,class_type,class_cost
0,1,5,R,2,5000,10000,2022,2nd,Lab,7507
1,2,10,F,3,5000,15000,2022,IS,Lecture,7190
2,3,1,K,3,4500,13500,2023,IS,Lecture,6058
3,4,4,L,3,4500,13500,2023,1st,Lecture,5864
4,5,6,E,3,5000,15000,2023,IS,Lecture,7027

In [139]:
departments_df.head()

   department_id                                    department_name  school_id
0              1                     Department of Computer Science          1
1              2  Department of Information Systems and Computer...          1
2              3                          Department of Mathematics          1
3              4                              Department of Physics          1
4              5                            Department of Chemistry          1

In [140]:
schools_df.head()

   school_id                                        school_name
0          1                  School of Science and Engineering
1          2                John Gokongwei School of Management
2          3                               School of Humanities
3          4                          School of Social Sciences
4          5  Gokongwei Brothers School of Education and Lea...

In [141]:
students_df.head()

   student_id    student_name  year_level
0           1   William Chung           4
1           2   Rachel Golden           2
2           3     Mark Wright           2
3           4  Jessica Castro           4
4           5    Laura Wilcox           2

In [142]:
# Merge the Enlistment Facts with Classes, Departments, and Schools
merged_df = pd.merge(enlistment_facts_df, classes_df, how='left', on='class_id')
merged_df = pd.merge(merged_df, departments_df, how='left', on='department_id')
merged_df = pd.merge(merged_df, schools_df, how='left', on='school_id')
merged_df = pd.merge(merged_df, payments_df, how='left', on='payment_id')
merged_df = pd.merge(merged_df, students_df, how='left', on='student_id')

merged_df.head()

,student_id,class_id,payment_id,department_id,section_label,units,rate_per_unit,revenue_per_student,class_year,class_semester,class_type,class_cost,department_name,school_id,school_name,payment_status,student_name,year_level
0,1,43,1,7,H,3,5000,15000,2022,2nd,Lecture,5252,Department of Psychology,4,School of Social Sciences,On Time,William Chung,4
1,1,17,2,7,X,3,5000,15000,2023,2nd,Lecture,7810,Department of Psychology,4,School of Social Sciences,On Time,William Chung,4
2,1,44,3,8,V,3,5000,15000,2022,1st,Lecture,6563,Department of History,4,School of Social Sciences,On Time,William Chung,4
3,1,39,4,6,L,3,4500,13500,2023,1st,Lecture,6191,Department of Biology,1,School of Science and Engineering,Late,William Chung,4
4,1,31,5,10,K,3,4500,13500,2022,1st,Lecture,5113,Department of English,3,School of Humanities,On Time,William Chung,4

## Extracting Metrics

In [143]:
# Revenue per school and department for the current semester vs the last semester of the same school year

In [144]:
# Revenue per school and department for the current semester of the current year vs the same semester of the last school year

In [145]:
# Which school offers the most profitable classes?

In [146]:
# Which department offers the most profitable classes?